article/setup-hadoop.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-19 Sat 14:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>配置Hadoop环境</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">配置Hadoop环境</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2814a23">1. 下载和并解压 Hadoop</a></li>
<li><a href="#org25ea1c9">2. 配置好相关的环境变量</a></li>
<li><a href="#orgd562fee">3. 配置 core-site.xml</a></li>
<li><a href="#org346c71c">4. 配置 hdfs-site.xml</a></li>
<li><a href="#org2294bf6">5. 格式化 HDFS 文件系统</a></li>
<li><a href="#org1edacb1">6. 启动关闭 Hadoop 相关服务</a></li>
<li><a href="#org0b1fb45">7. 网页浏览工具</a></li>
<li><a href="#orgd94a42f">8. 参考链接</a></li>
</ul>
</div>
</div>


<div id="outline-container-org2814a23" class="outline-2">
<h2 id="org2814a23"><span class="section-number-2">1</span> 下载和并解压 Hadoop</h2>
<div class="outline-text-2" id="text-1">
<p>
可以直接在<a href="https://mirrors.tuna.tsinghua.edu.cn/apache/hadoop/core/">清华镜像源</a>下载，解压到对应目录
</p>
<div class="org-src-container">
<pre class="src src-sh">wget https://mirrors.tuna.tsinghua.edu.cn/apache/hadoop/core/hadoop-2.7.7/hadoop-2.7.7.tar.gz
mkdir -p /usr/local/java
tar xzvf hadoop-2.7.7.tar.gz
</pre>
</div>
</div>
</div>

<div id="outline-container-org25ea1c9" class="outline-2">
<h2 id="org25ea1c9"><span class="section-number-2">2</span> 配置好相关的环境变量</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #6c71c4;">export</span> <span style="color: #6c71c4;">HADOOP_HOME</span>=${<span style="color: #6c71c4;">HADOOP_HOME</span>:/usr/local/java/hadoop-2.7.7}
<span style="color: #6c71c4;">export</span> <span style="color: #6c71c4;">HADOOP_DATA</span>=<span style="color: #2aa198;">"$HADOOP_HOME/data"</span>
<span style="color: #6c71c4;">export</span> <span style="color: #6c71c4;">PATH</span>=<span style="color: #2aa198;">"$HADOOP_HOME/bin:$PATH"</span>
<span style="color: #6c71c4;">alias</span> <span style="color: #6c71c4;">h0</span>=<span style="color: #2aa198;">"$HADOOP_HOME/sbin/stop-all.sh"</span>
<span style="color: #6c71c4;">alias</span> <span style="color: #6c71c4;">h1</span>=<span style="color: #2aa198;">"$HADOOP_HOME/sbin/start-all.sh"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd562fee" class="outline-2">
<h2 id="orgd562fee"><span class="section-number-2">3</span> 配置 core-site.xml</h2>
<div class="outline-text-2" id="text-3">
<p>
添加 HDFS 的端口为 9600
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #b58900;">configuration</span>&gt;
  &lt;<span style="color: #b58900;">property</span>&gt;
    &lt;<span style="color: #b58900;">name</span>&gt;fs.defaultFS&lt;/<span style="color: #b58900;">name</span>&gt;
    &lt;<span style="color: #b58900;">value</span>&gt;hdfs://localhost:9600&lt;/<span style="color: #b58900;">value</span>&gt;
  &lt;/<span style="color: #b58900;">property</span>&gt;
&lt;/<span style="color: #b58900;">configuration</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org346c71c" class="outline-2">
<h2 id="org346c71c"><span class="section-number-2">4</span> 配置 hdfs-site.xml</h2>
<div class="outline-text-2" id="text-4">
<p>
添加 HDFS 的 NameNode 和 DataNode 的路径，并将备份副本数量设置为 1
</p>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #b58900;">configuration</span>&gt;
  &lt;<span style="color: #b58900;">property</span>&gt;
    &lt;<span style="color: #b58900;">name</span>&gt;dfs.name.dir&lt;/<span style="color: #b58900;">name</span>&gt;
    &lt;<span style="color: #b58900;">value</span>&gt;/usr/local/java/hadoop-2.7.7/data/name&lt;/<span style="color: #b58900;">value</span>&gt;
  &lt;/<span style="color: #b58900;">property</span>&gt;
  &lt;<span style="color: #b58900;">property</span>&gt;
    &lt;<span style="color: #b58900;">name</span>&gt;dfs.data.dir&lt;/<span style="color: #b58900;">name</span>&gt;
    &lt;<span style="color: #b58900;">value</span>&gt;/usr/local/java/hadoop-2.7.7/data/data&lt;/<span style="color: #b58900;">value</span>&gt;
  &lt;/<span style="color: #b58900;">property</span>&gt;
  &lt;<span style="color: #b58900;">property</span>&gt;
    &lt;<span style="color: #b58900;">name</span>&gt;dfs.replication&lt;/<span style="color: #b58900;">name</span>&gt;
    &lt;<span style="color: #b58900;">value</span>&gt;1&lt;/<span style="color: #b58900;">value</span>&gt;
  &lt;/<span style="color: #b58900;">property</span>&gt;
&lt;/<span style="color: #b58900;">configuration</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org2294bf6" class="outline-2">
<h2 id="org2294bf6"><span class="section-number-2">5</span> 格式化 HDFS 文件系统</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-sh">hdfs namenode -format
</pre>
</div>
</div>
</div>

<div id="outline-container-org1edacb1" class="outline-2">
<h2 id="org1edacb1"><span class="section-number-2">6</span> 启动关闭 Hadoop 相关服务</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-sh">$<span style="color: #6c71c4;">HADOOP_HOME</span>/sbin/startk-all.sh
$<span style="color: #6c71c4;">HADOOP_HOME</span>/sbin/stop-all.sh
</pre>
</div>
</div>
</div>

<div id="outline-container-org0b1fb45" class="outline-2">
<h2 id="org0b1fb45"><span class="section-number-2">7</span> 网页浏览工具</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li>NameNode 属性查看 <a href="http://localhost:50070">http://localhost:50070</a></li>
</ol>
</div>
</div>

<div id="outline-container-orgd94a42f" class="outline-2">
<h2 id="orgd94a42f"><span class="section-number-2">8</span> 参考链接</h2>
<div class="outline-text-2" id="text-8">
<ol class="org-ol">
<li><a href="http://hadoop.apache.org/docs/r2.7.7/">Hadoop 文档</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2020-09-19 Sat 14:19. Created by Jinghui Hu at 2020-09-19 Sat 13:57.</p>
</div>
</body>
</html>
